{
    "definitions" :[
        {
            "id": 0,
            "fallacy": "Ad Hominem",
            "explanation": "This fallacy occurs when the speaker is attacking the other person or some aspect of them rather than addressing the argument itself.",
            "image_url":"/icons/ad_hominem.png"
        },
        {
            "id": 1,
            "fallacy": "Appeal To Authority",
            "explanation": "This fallacy occurs when an argument relies on the opinion or endorsement of an authority figure who may not have relevant expertise or whose expertise is questionable. When applicable, a scientific consensus is not an appeal to authority.",
            "image_url":"/icons/authority.png"
        },
        {
            "id": 2,
            "fallacy": "Appeal To Emotion",
            "explanation": "This fallacy occurs when emotion is used to support an argument, such as pity, fear, anger, etc.",
            "image_url":"/icons/emotion.png"
        },
        {
            "id": 3,
            "fallacy": "False Dilemma",
            "explanation": "This fallacy occurs when only two options are presented in an argument, even though more options may exist. A case of “either this or that”.",
            "image_url":"/icons/dilemma.png"
        },
        {
            "id": 4,
            "fallacy": "No Fallacy",
            "explanation": "No fallacy has been detected by the AI. However, the AI can make mistakes. Also, there are much more fallacies than the five fallacies the AI is trained on, e.g, Strawman, Cherry Picking and Red Herring.",
            "image_url":"/icons/none.png"
        },
        {
            "id": 5,
            "fallacy": "Slippery Slope",
            "explanation": "This fallacy occurs when someone argues that a event will trigger a series of events that lead to an extreme outcome without demonstrating any causal connections between the events.",
            "image_url":"/icons/slope.png"
        },
        {
            "id": 6,
            "fallacy": "Need more context",
            "explanation": "The AI could not make any reliable predictions based on your input text. Please try to adapt your text by adjusting the total number of words used or the meaning of your text.",
            "image_url":"/icons/context.png"
        }
    ],
    "game": [
        {
            "example": "With so many spelling mistakes in your comment, I'm sure the rest is wrong too.",
            "label": "adHominem"
        },
        {
            "example": "Elon Musk said it’s a good investment, so we should all invest.",
            "label": "authority"
        },
        {
            "example": "This new diet must be effective - a famous actor said it worked for him.",
            "label": "authority"
        },
        {
            "example": "If we don't act now, our children will grow up in a world without hope.",
            "label": "emotion"
        },
        {
            "example": "If you don’t take honors courses, you won’t get into a good college.",
            "label": "slope"
        },
        {
            "example": "Either you buy me this new book, or you decide that reading is not important at all.",
            "label": "dilemma"
        },
        {
            "example": "Person A: I think we should lower the legal drinking age. Person B: No, if we do that, we’ll have ten-year-olds getting drunk in bars!",
            "label": "slope"
        },
        {
            "example": "A famous actor said this supplement works, so it must be effective.",
            "label": "authority"
        },
        {
            "example": "Elon Musk said it’s a good investment, so we should all invest.",
            "label": "authority"
        },
        {
            "example": "This doctor on TV recommends this diet, so it's the best one.",
            "label": "authority"
        },
        {
            "example": "My professor said climate change isn’t real, so I don’t believe it is.",
            "label": "authority"
        },
        {
            "example": "The CEO supports the new policy, so it has to be the right decision.",
            "label": "authority"
        },
        {
            "example": "If we allow students to redo one test, soon they’ll expect to redo everything.",
            "label": "slope"
        },
        {
            "example": "Legalizing marijuana will lead to legalizing all drugs.",
            "label": "slope"
        },
        {
            "example": "If we allow remote work, no one will ever come to the office again.",
            "label": "slope"
        },
        {
            "example": "Today you skip one workout, tomorrow you’re completely out of shape.",
            "label": "slope"
        },
        {
            "example": "What would she know about relationships? She’s been divorced twice.",
            "label": "adHominem"
        },
        {
            "example": "That idea is ridiculous, just like everything else you say.",
            "label": "adHominem"
        },
        {
            "example": "You’re too young to understand anything about the real world.",
            "label": "adHominem"
        },
        {
            "example": "Increasing green spaces in urban areas can improve mental health.",
            "label": "none"
        },
        {
            "example": "The data from last quarter supports the need for a budget adjustment.",
            "label": "none"
        },
        {
            "example": "More frequent public transport reduces traffic congestion.",
            "label": "none"
        }
    ]
}